In [1]:
import pandas as pd

In [2]:

df=pd.read_csv("titanic_dataset.csv")

In [ ]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [ ]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
# Name less than 35 age
age_lessthan_35= df.loc[df['Age']<35,'Name']

In [9]:
age_lessthan_35.shape

(479,)

In [10]:
age_lessthan_35.head()

0                              Braund, Mr. Owen Harris
2                               Heikkinen, Miss. Laina
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [ ]:
# Rows from index 10 to 25 and Columns 3 to 5 :
subset = df.iloc[10:25, 2:5]
print(subset)

    Pclass                                               Name     Sex
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female
25       3  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female

In [ ]:
# Statistics aggregate of Age & Fare :
agg_functions = {
        "Age": ["min", "max", "median", "mean"],
        "Fare": ["min", "max", "median", "mean"],
         }

In [ ]:
statistics = df.agg(agg_functions)
print(statistics)

              Age         Fare
min      0.420000     0.000000
max     80.000000   512.329200
median  28.000000    14.454200
mean    29.699118    32.204208
std     14.526497    49.693429
skew     0.389108          NaN
var           NaN  2469.436846

In [ ]:
# Mean price group by sex and cabin class
mean_price = df.groupby(["Sex", "Pclass"])["Fare"].mean()
print(mean_price)

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64